import { shiftGrid } from '.'

describe('1260.二维网格迁移', () => {
  it('示例一', () => {
    expect(shiftGrid([[1, 2, 3], [4, 5, 6], [7, 8, 9]], 1)).toStrictEqual([[9, 1, 2], [3, 4, 5], [6, 7, 8]])
  })

  it('示例二', () => {
    expect(shiftGrid([[1, 2, 3], [4, 5, 6], [7, 8, 9]], 9)).toStrictEqual([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
  })

  it('示例三', () => {
    expect(shiftGrid([[3, 8, 1, 9], [19, 7, 2, 5], [4, 6, 11, 10], [12, 0, 21, 13]], 4)).toStrictEqual([[12, 0, 21, 13], [3, 8, 1, 9], [19, 7, 2, 5], [4, 6, 11, 10]])
  })
})
